{"data":{"post":{"title":"Better late than never","createdAt":"2019-01-10T11:46:21.139Z","updatedAt":"2019-01-16T12:00:19.303Z","tags":["gatsbyjs","reactjs","success_story"],"content":{"childContentfulRichText":{"html":"<h2>First steps</h2><p>First time I thought about creating personal site was when I was taking java courses at EPAM Systems. The main motivation was to learn new things. So I&#39;ve created a list of technologies I wanted to build my blog with:</p><img src=\"//images.ctfassets.net/6dybdba3jdxv/75V7RcvbvGO4UuOkAwagOm/6ffff68b0791c34c9822a8f049ae568c/blog-tech-stack.jpg\" alt=\"Initial list of technologies to use in personal blog\" style=\"display: block; max-width: 450px; margin: 0 auto\" /><p>At that moment I haven&#39;t worked with either of them (except MySQL I guess) and hardly understood how I could wire them all together. Also you might noticed that I didn&#39;t write a word about infrastructure and deployment of my future site (I had no idea about it).</p><p>Time went on, I got a job, started to get familiar with technologies from my list: we actively used <a href=\"https://www.liquibase.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Liquibase</a> on my first project; I figured out that I can use fancy groovy and gradle instead of xml and maven to write build scripts; but the main frontend library was jQuery, and it was clear that I wouldn&#39;t like to use it in personal project. In a year I joined project with AngularJS, one more year later I had realized that I would not use either :-)</p><h2>Getting closer to right stack</h2><p>Meanwhile react was getting more and more popular. And I decided to give it a try: colleagues of mine and I started local frontend community - WebPurple and to be true frontend community it must have its own site. Its first version has under the hood: react, redux,material-ui, koa, mongoose and was deployed to some VPS. I&#39;ve learned a couple of things:</p><ul><li><p>Material Design fits tools best (not sites)</p></li><li><p>managing content manually is bad idea</p></li><li><p>IaaS is overkill (also painful) as well as PaaS (after a couple of months fighting with manual setup of all infrastructure to VM I&#39;ve moved to heroku and mlab) for promo site</p></li><li><p>I don&#39;t want to pay for hosting (or a at least it to be cheap)</p></li><li><p>I want WebPurple site to be BLAZING fast (without much effort)</p></li></ul><h2>Love at second sight</h2><p>Any ideas on what I am gonna talking about? Static site generation, <a href=\"https://jamstack.org/\" target=\"_blank\" rel=\"noopener noreferrer\">JAMStack</a>, <a href=\"https://gatsbyjs.org\" target=\"_blank\" rel=\"noopener noreferrer\">GastbyJS</a>! In early 2018, I began to hear more and more about Gatsby. I don&#39;t know why didn&#39;t pay much attention to it when I first time heard about it (I might thought it is not applicable for my cases). But after I started to investigate the approach (JAMStack) it offers I had fallen in love 😍. It took me about 2 weeks to migrate the whole (thought it is not that big) site from koa, mongodb and heroku to gatsby, <a href=\"https://www.netlifycms.org\" target=\"_blank\" rel=\"noopener noreferrer\">netlify-cms</a> and <a href=\"https://netlify.com\" target=\"_blank\" rel=\"noopener noreferrer\">netlify</a>.</p><ul><li><p>⚡️site had perfect performance by default</p><ul><li><p>static markup (first load)</p></li><li><p>code splitting</p></li><li><p>image optimization</p></li><li><p>prefetch...</p></li></ul></li><li><p>💃content is easily managed via CMS</p><ul><li><p>user friendly UI</p></li><li><p>extensible (build on react)</p></li><li><p>content stored alongside your code (in git repo!)...</p></li></ul></li><li><p>🙈infrastructure is the simplest (ADN aka better CDN)</p><ul><li><p>CD - deploy on every git push</p></li><li><p>automatic PR preview</p></li><li><p>https, custom domains, AWS lambdas...</p></li></ul></li></ul><p>You can checkout the result - <a href=\"https://www.webpurple.net/\" target=\"_blank\" rel=\"noopener noreferrer\">www.webpurple.net</a> (<a href=\"https://github.com/WebPurple/site\" target=\"_blank\" rel=\"noopener noreferrer\">source</a>). I&#39;ve even given a <a href=\"https://www.youtube.com/watch?v=Im95DcXzTEU\" target=\"_blank\" rel=\"noopener noreferrer\">talk</a> (russian) about it.</p><p>Later I&#39;ve applied gatsby for one of my customers news site, but with a bit different setup: <a href=\"https://strapi.io\" target=\"_blank\" rel=\"noopener noreferrer\">strapi</a> as a CMS and Jenkins as a CD tool.</p><h2>Happy end</h2><p>Finally I felt like I&#39;ve found best toolchain and it was time to get my hands on personal site. Since I fill pretty comfortable with technical stack (although this time I use <a href=\"https://www.contentful.com/\" target=\"_blank\" rel=\"noopener noreferrer\">contentful</a> as CMS, <a href=\"https://travis-ci.com/kitos/kitos.github.io\" target=\"_blank\" rel=\"noopener noreferrer\">travis</a> as CI/CD and github pages as a hosting), my motivation is less about learning new things and more about improving my english (via writing articles about amazing things I deal with) and a bit of showing off 🤓. I hope you enjoy the site (its unique design 😇). And you started to think about building your one (using great gatsby of course). Keep in mind that gatsby is suitable not only for blogs or promo-sites, it can make any of your sites performant (<a href=\"https://www.gatsbyjs.org/docs/ecommerce-tutorial/#why-use-gatsby-for-an-e-commerce-site\" target=\"_blank\" rel=\"noopener noreferrer\">even for e-commerce project</a>).</p><h3>P.S.</h3><p>By the way I&#39;ve <a href=\"https://github.com/kitos/kitos.github.io/commit/f150b40d37153442626414ee176e2e3658f3fec0\" target=\"_blank\" rel=\"noopener noreferrer\">started to develop my site</a> before <a href=\"https://github.com/gaearon/overreacted.io/commit/6934bcaf38e81d77e7bf662b9daa97a6be9affa9\" target=\"_blank\" rel=\"noopener noreferrer\">it had become mainstream</a> 😂.</p>"}}},"site":{"meta":{"siteUrl":"https://www.nikitakirsanov.com"}}},"pageContext":{"slug":"better-late-than-never"}}